app/views/oenologists/index.html.erb

        <td>
          <% oenologist.oenologist_magazines.all.each do |om| %>
---
SELECT "oenologists".* FROM "oenologists"
SELECT "oenologist_magazines".* FROM "oenologist_magazines" WHERE "oenologist_magazines"."oenologist_id" = $1  [["oenologist_id", 7]]