app/controllers/cepas_controller.rb

SELECT "cepas".* FROM "cepas"
---
  def index
    @cepas = Cepa.all

INSERT INTO "cepas" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Merlot"], ["created_at", "2020-06-01 21:16:22.914292"], ["updated_at", "2020-06-01 21:16:22.914292"]]
---
  def create
    @cepa = Cepa.new(cepa_params)

    respond_to do |format|
      if @cepa.save

UPDATE "cepas" SET "name" = $1, "updated_at" = $2 WHERE "cepas"."id" = $3  [["name", "Cepa1"], ["updated_at", "2020-06-02 01:20:52.431802"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @cepa.update(cepa_params)

SELECT  "cepas".* FROM "cepas" WHERE "cepas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_cepa
      @cepa = Cepa.find(params[:id])