app/controllers/magazines_controller.rb

  def index
    @magazines = Magazine.all
---
SELECT "magazines".* FROM "magazines"

  def create
    @magazine = Magazine.new(magazine_params)

    respond_to do |format|
      if @magazine.save
---
INSERT INTO "magazines" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Buenos pal Vino"], ["created_at", "2020-06-03 21:02:33.026416"], ["updated_at", "2020-06-03 21:02:33.026416"]]

    def set_magazine
      @magazine = Magazine.find(params[:id])
---
SELECT  "magazines".* FROM "magazines" WHERE "magazines"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]