app/controllers/oenologists_controller.rb

  def index
    @oenologists = Oenologist.all
---
SELECT "oenologists".* FROM "oenologists"

  def new
    @oenologist = Oenologist.new
    @magazineList = Magazine.order(:id)
---
SELECT "magazines".* FROM "magazines" ORDER BY "magazines"."id" ASC

  def create
    @oenologist = Oenologist.new(oenologist_params)
    @oenologist.save
    @oenologist = Oenologist.last
    @cargos = params[:cargos]
    @magazine = params[:magazine_id]
    @cargos.each do |cargo|
      @oenologist_magazine = OenologistMagazine.new()
      @oenologist_magazine.oenologist_id = @oenologist.id
      @oenologist_magazine.magazine_id = @magazine
      @oenologist_magazine.charge = cargo
      @oenologist_magazine.save
    end
    respond_to do |format|
      if @oenologist.save
---
INSERT INTO "oenologists" ("name", "age", "nationality", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "John Doe"], ["age", 23], ["nationality", "Australiano"], ["created_at", "2020-06-03 03:47:42.440472"], ["updated_at", "2020-06-03 03:47:42.440472"]]
SELECT  "oenologists".* FROM "oenologists" ORDER BY "oenologists"."id" DESC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "oenologist_magazines" ("oenologist_id", "magazine_id", "charge", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["oenologist_id", 7], ["magazine_id", 2], ["charge", "[\"Editor\", \"Writter\", \"Reviewer\"]"], ["created_at", "2020-06-04 01:34:44.681231"], ["updated_at", "2020-06-04 01:34:44.681231"]]
INSERT INTO "oenologists" ("name", "age", "nationality", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "John Doe"], ["age", 23], ["nationality", "Australiano"], ["created_at", "2020-06-04 01:26:04.602906"], ["updated_at", "2020-06-04 01:26:04.602906"]]

  def update
    respond_to do |format|
      if @oenologist.update(oenologist_params)
---
UPDATE "oenologists" SET "age" = $1, "updated_at" = $2 WHERE "oenologists"."id" = $3  [["age", 43], ["updated_at", "2020-06-09 23:56:23.896863"], ["id", 10]]

  def destroy
    @oenologist.destroy
---
DELETE FROM "oenologists" WHERE "oenologists"."id" = $1  [["id", 4]]

    def set_oenologist
      @oenologist = Oenologist.find(params[:id])
---
SELECT  "oenologists".* FROM "oenologists" WHERE "oenologists"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]