app/controllers/wines_controller.rb

SELECT "wines".* FROM "wines"
---
  def index
    @wines = Wine.all

SELECT "cepas".* FROM "cepas" ORDER BY "cepas"."id" ASC
SELECT "oenologists".* FROM "oenologists"
---
  def new
    @operacion = 'New'
    @wine = Wine.new
    @cepaList = Cepa.order(:id)
    @enologos = Oenologist.all

SELECT "oenologists".* FROM "oenologists" ORDER BY "oenologists"."id" ASC
SELECT  "evaluations".* FROM "evaluations" WHERE "evaluations"."wine_id" = $1 LIMIT $2  [["wine_id", 32], ["LIMIT", 1]]
SELECT "wine_cepas".* FROM "wine_cepas" WHERE "wine_cepas"."wine_id" = $1  [["wine_id", 15]]
---
  def edit
    @operacion = 'Edit'
    @enologos = Oenologist.all
    @evaluation = Evaluation.where(wine_id: params["id"])
    @cepaList = WineCepa.where(wine_id:  params["id"])

INSERT INTO "wines" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", ""], ["created_at", "2020-06-08 20:04:13.941881"], ["updated_at", "2020-06-08 20:04:13.941881"]]
SELECT  "wines".* FROM "wines" ORDER BY "wines"."id" DESC LIMIT $1  [["LIMIT", 1]]
SELECT "cepas".* FROM "cepas"
INSERT INTO "wines" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "asdf"], ["created_at", "2020-06-10 08:01:14.981915"], ["updated_at", "2020-06-10 08:01:14.981915"]]
INSERT INTO "wine_cepas" ("wine_id", "cepa_id", "percentage", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["wine_id", 29], ["cepa_id", 2], ["percentage", 38.0], ["created_at", "2020-06-08 20:25:54.359407"], ["updated_at", "2020-06-08 20:25:54.359407"]]
SELECT  "oenologists".* FROM "oenologists" WHERE "oenologists"."name" = $1 LIMIT $2  [["name", "John Doe"], ["LIMIT", 1]]
INSERT INTO "evaluations" ("wine_id", "oenologist_id", "rank", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["wine_id", 32], ["oenologist_id", 10], ["rank", 56.0], ["created_at", "2020-06-08 20:36:02.252892"], ["updated_at", "2020-06-08 20:36:02.252892"]]
UPDATE "wine_cepas" SET "percentage" = $1, "updated_at" = $2 WHERE "wine_cepas"."id" = $3  [["percentage", 89.0], ["updated_at", "2020-06-05 00:31:33.037437"], ["id", 6]]
UPDATE "wines" SET "name" = $1, "updated_at" = $2 WHERE "wines"."id" = $3  [["name", "pruebaEdit"], ["updated_at", "2020-06-04 22:42:55.131572"], ["id", 15]]
INSERT INTO "evaluations" ("wine_id", "oenologist_id", "rank", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["wine_id", 39], ["oenologist_id", 11], ["rank", 31.0], ["created_at", "2020-06-10 07:49:09.738192"], ["updated_at", "2020-06-10 07:49:09.738192"]]
---
  def create

    @wine.save
    @wine = Wine.last
    @cepas = Cepa.all
    @enologos = params["enologos"]
    @cepas.each do |cepa|
      @wine_cepa = WineCepa.new()
      @porcentaje = params[cepa.name]
      if @porcentaje.to_i > 0
        @wine_cepa.wine_id = @wine.id
        @wine_cepa.cepa_id = cepa.id
        @wine_cepa.percentage = @porcentaje.to_i
        @wine_cepa.save
      end
    end
    if !@enologos.nil?
      @enologos.each do |enologo|
        @evaluation = Evaluation.new()
        @rank = params[enologo]
        @evaluation.wine_id = @wine.id
        @evaluation.oenologist_id = Oenologist.find_by(name: enologo).id
        @evaluation.rank = @rank
        @evaluation.save
      end
    end
    respond_to do |format|
      if @wine.save

SELECT  "wine_cepas".* FROM "wine_cepas" WHERE "wine_cepas"."wine_id" = $1 AND "wine_cepas"."cepa_id" = $2 LIMIT $3  [["wine_id", 15], ["cepa_id", 1], ["LIMIT", 1]]
SELECT "wine_cepas".* FROM "wine_cepas" WHERE "wine_cepas"."wine_id" = $1  [["wine_id", 32]]
SELECT  "wine_cepas".* FROM "wine_cepas" WHERE "wine_cepas"."wine_id" = $1 AND "wine_cepas"."cepa_id" = $2 LIMIT $3  [["wine_id", 32], ["cepa_id", 1], ["LIMIT", 1]]
UPDATE "wines" SET "name" = $1, "updated_at" = $2 WHERE "wines"."id" = $3  [["name", "pruebaEdit"], ["updated_at", "2020-06-04 22:42:55.131572"], ["id", 15]]
UPDATE "wine_cepas" SET "percentage" = $1, "updated_at" = $2 WHERE "wine_cepas"."id" = $3  [["percentage", 50.0], ["updated_at", "2020-06-04 23:34:09.440840"], ["id", 6]]
DELETE FROM "wine_cepas" WHERE "wine_cepas"."wine_id" = $1  [["wine_id", 20]]
DELETE FROM "wines" WHERE "wines"."id" = $1  [["id", 20]]
SELECT  "oenologists".* FROM "oenologists" WHERE "oenologists"."name" = $1 LIMIT $2  [["name", "John Doe"], ["LIMIT", 1]]
SELECT  "evaluations".* FROM "evaluations" WHERE "evaluations"."oenologist_id" = $1 AND "evaluations"."wine_id" = $2 LIMIT $3  [["oenologist_id", 10], ["wine_id", 32], ["LIMIT", 1]]
UPDATE "evaluations" SET "rank" = $1, "updated_at" = $2 WHERE "evaluations"."id" = $3  [["rank", 70.0], ["updated_at", "2020-06-09 23:22:15.580420"], ["id", 1]]
INSERT INTO "evaluations" ("wine_id", "oenologist_id", "rank", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["wine_id", 32], ["oenologist_id", 11], ["rank", 68.0], ["created_at", "2020-06-09 23:50:45.355370"], ["updated_at", "2020-06-09 23:50:45.355370"]]
UPDATE "evaluations" SET "rank" = $1, "updated_at" = $2 WHERE "evaluations"."id" = $3  [["rank", 13.0], ["updated_at", "2020-06-09 23:51:14.046719"], ["id", 5]]
---
  def update
    @wine_id = params["id"]
    @cepas = WineCepa.where(wine_id:  params["id"])
    @enologos = params["enologos"]
    @cepas.each do |cepa|
      @cepa_params = cepa.cepa.name
      @porcentaje = params[@cepa_params]
      if @porcentaje.to_i > 0

        wineCepa = WineCepa.find_by(wine_id: @wine_id, cepa_id: cepa.cepa_id)
        wineCepa.update(percentage: @porcentaje.to_i)
      else
        WineCepa.find_by(wine_id: @wine_id, cepa_id: cepa.cepa_id).destroy
      end
    end
    @enologos.each do |enologo|
      @rank = params[enologo]
      @evaluation_oenologist_id = Oenologist.find_by(name: enologo).id
      @evaluation_wine_id = @wine.id
      @evaluation = Evaluation.find_by(oenologist_id: @evaluation_oenologist_id, wine_id: @evaluation_wine_id)
      if @evaluation.nil?
        @evaluation = Evaluation.new()
        @evaluation.wine_id = @evaluation_wine_id
        @evaluation.oenologist_id = @evaluation_oenologist_id
        @evaluation.rank = @rank
        @evaluation.save
      else
        @evaluation.update(rank: @rank)

DELETE FROM "wines" WHERE "wines"."id" = $1  [["id", 32]]
---
  def destroy
    @wine.destroy

SELECT  "wines".* FROM "wines" WHERE "wines"."id" = $1 LIMIT $2  [["id", 32], ["LIMIT", 1]]
---
    def set_wine
      @wine = Wine.find(params[:id])