app/views/wines/_form.html.erb

SELECT  "evaluations".* FROM "evaluations" WHERE "evaluations"."oenologist_id" = $1 AND "evaluations"."wine_id" = $2 LIMIT $3  [["oenologist_id", 10], ["wine_id", 32], ["LIMIT", 1]]
---
          <% @enologos.order(:age).each do |e| %>
            <% if Evaluation.find_by(oenologist_id: e.id, wine_id: wine.id).present? %>

SELECT  "evaluations".* FROM "evaluations" WHERE "evaluations"."oenologist_id" = $1 LIMIT $2  [["oenologist_id", 10], ["LIMIT", 1]]
SELECT  "evaluations".* FROM "evaluations" WHERE "evaluations"."oenologist_id" = $1 LIMIT $2  [["oenologist_id", 11], ["LIMIT", 1]]
---
                  <label>Nota: </label>
                  <input type="range" min="1" max="100" value="<%= Evaluation.find_by(oenologist_id: e.id).rank %>" name="<%= e.name%>"   onchange="porcentaje(value, name)">
                    <span id="<%= e.name%>"><%= Evaluation.find_by(oenologist_id: e.id).rank %></span>