app/views/wines/index.html.erb

SELECT "wine_cepas".* FROM "wine_cepas" WHERE "wine_cepas"."wine_id" = $1 ORDER BY "wine_cepas"."cepa_id" ASC  [["wine_id", 15]]
---
        <td>
          <% wine.wine_cepas.order(:cepa_id).each do |wc| %>

SELECT "evaluations".* FROM "evaluations" WHERE "evaluations"."wine_id" = $1  [["wine_id", 16]]
---
        <td>
          <% if wine.evaluations.present? %>

SELECT  "oenologists".* FROM "oenologists" WHERE "oenologists"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
                <div class="row" style="margin-left:0;">
                  <%= Oenologist.find_by(id: e.oenologist_id).name%>: <%=e.rank%>